import re

text = input()
regex = r"(^|(?<=\s))-?([0]|[1-9][0-9]*)(\.\d+)?($|(?=\s))"
result = re.finditer(regex, text)

for res in result:
    print(res.group(), end=" ")

# (^|(?<=\s)) - създаваме група с (), в нея питаме дали думата е начална "^" или "|" дали "?"
# има разстояние "s" преди "<=" думата

# -? - с това питаме дали имаме минус, в двата случаи е вярно,
# ако няма минус ще продължи, ако има минус ще вземе и минуса

# ([0 - 9]|[1-9][0-9]*) - ако имаме само една цифра ще вземем цифрата която е между 0-9 [0-9] или "|" ако са повече
# от една цифра тогава първата трябва да е между 1-9 а втората между 0-9, ако са повече "*" продължава с 0-9

# (\.\d+)? - ако "?" следващият симвул е точка "\." запиши всичките числа след точката "\d+"

# ($|(?=\s)) - Ако думата е последна "$" или "|" ако "?" след думата "=" има разстояние "s"

